content/man/man1/git-request-pull.1.org
#+TITLE: Manpages - git-request-pull.1
* NAME
git-request-pull - Generates a summary of pending changes

* SYNOPSIS
#+begin_example
git request-pull [-p] <start> <URL> [<end>]
#+end_example

* DESCRIPTION
Generate a request asking your upstream project to pull changes into
their tree. The request, printed to the standard output, begins with the
branch description, summarizes the changes, and indicates from where
they can be pulled.

The upstream project is expected to have the commit named by *<start>*
and the output asks it to integrate the changes you made since that
commit, up to the commit named by *<end>*, by visiting the repository
named by *<URL>*.

* OPTIONS
-p

#+begin_quote
Include patch text in the output.

#+end_quote

<start>

#+begin_quote
Commit to start at. This names a commit that is already in the upstream
history.

#+end_quote

<URL>

#+begin_quote
The repository URL to be pulled from.

#+end_quote

<end>

#+begin_quote
Commit to end at (defaults to HEAD). This names the commit at the tip of
the history you are asking to be pulled.

When the repository named by *<URL>* has the commit at a tip of a ref
that is different from the ref you have locally, you can use the
*<local>:<remote>* syntax, to have its local name, a colon *:*, and its
remote name.

#+end_quote

* EXAMPLES
Imagine that you built your work on your *master* branch on top of the
*v1.0* release, and want it to be integrated into the project. First you
push that change to your public repository for others to see:

#+begin_quote
#+begin_example
git push https://git.ko.xz/project master
#+end_example

#+end_quote

Then, you run this command:

#+begin_quote
#+begin_example
git request-pull v1.0 https://git.ko.xz/project master
#+end_example

#+end_quote

which will produce a request to the upstream, summarizing the changes
between the *v1.0* release and your *master*, to pull it from your
public repository.

If you pushed your change to a branch whose name is different from the
one you have locally, e.g.

#+begin_quote
#+begin_example
git push https://git.ko.xz/project master:for-linus
#+end_example

#+end_quote

then you can ask that to be pulled with

#+begin_quote
#+begin_example
git request-pull v1.0 https://git.ko.xz/project master:for-linus
#+end_example

#+end_quote

* GIT
Part of the *git*(1) suite
